'''
A 회사 총무부서가 분주합니다.
중요한 파일이 모두 들어있는 컴퓨터의 비밀번호를 까먹었기 때문입니다. 
다행히 책상에는 전임자가 놓고간 힌트가 담긴 쪽지가 놓여있습니다. 
쪽지의 내용은 이러합니다.

'비밀번호는 쉴새없이 변하며, 컴퓨터 화면에는 매 번 일련의 문자들이 주어집니다. 
단 컴퓨터 화면에서 알파벳 c까지의 알파벳 문자열이 비밀번호입니다.'

머리가 좋은 김대리는 바로 이해를 하고 암호를 풀었습니다. 
이때 김대리가 사용한 방법을 프로그램으로 작성하세요.
------------------------------------------------------------------------
[입력값 설명]
『알파벳 소문자들이 공백을 두고 한개씩 계속 입력됩니다.
문자의 개수는 20개 이하입니다.』

[출력값 설명]
『알파벳 c를 입력할때까지 입력한 알파벳들을 공백을 두고 출력합니다.
(c도 포함하기 때문에, 비밀번호의 마지막 글자는 c가 됩니다.)
맨 처음부터 c가 입력되는 경우는 없다고 가정합니다.』
------------------------------------------------------------------------
예제 입력1
s a d k f a s c a s d

예제 출력1
s a d k f a s c

예제 입력2
s a p o a c a s o

예제 출력2
s a p o a c
'''
# -*- coding: utf-8 -*-
import sys
sys.stdin=open('input.txt', 'r')

if __name__=="__main__":
    arr = list(map(str, input().split()))
    res = []
    for a in arr:
        res.append(a)
        if a == 'c':
            break
    
    print(*res)
    
