'''
중학생이 된 수진은 수학시간에 어떤 음이아닌 정수 N을 b진수로 표현하는 방법을 배웠습니다.
어떤 수를 b진수로 변환하려면 그 수를 0이 될 때까지 b로 나누고, 그 나머지를 거꾸로 읽어 올라가면 됩니다.

예를 들어 99를 8진수로 변환하는 과정은 다음과 같습니다.
99를 8로 나눈 몫은 12이고 나머지는 3입니다.
12를 8로 나눈 몫은 1이고 나머지는 4입니다.
1을 8로 나눈 몫은 0이고 나머지는 1입니다.
나머지를 거꾸로 읽어 올라가면 143이므로 99를 8진수로 표현하면 143입니다.

한편, 28을 16진수로 변환하는 과정은 다음과 같습니다.
이때 나머지가 10~15 인 경우 편의상 A~F로 나타냅니다. 

즉, 나머지가 10이면 A, 11이면 B, 12이면 C로 대신 표현합니다.

28을 16으로 나누면 몫이 1이고 나머지는 12, 즉 C입니다.
1을 16으로 나누면 몫이 0이고 나머지는 1입니다.
나머지를 거꾸로 읽어 올라가면 1C이므로 28을 16진수로 표현하면 1C입니다.

수진은 N을 8진수와 16진수로 표현해봤는데 본인이 맞게 표현했는지 궁금해졌습니다.
수진을 위해 10진수 N을 입력 받아 그 수의 8진수와 16진수 표현을 모두 출력하는 프로그램을 작성하세요.
------------------------------------------------------------------------------
[입력값 설명]
『10진수 정수 N이 입력됩니다. (0 ≤ N ≤ 1,000,000)』

[출력값 설명]
『10진수 정수 N에 대해서 공백을 기준으로 8진수로 변환한 숫자와 16진수로 변환한 숫자를 출력합니다.
이 때 알파벳은 대문자로 출력합니다.』
------------------------------------------------------------------------------
예제 입력1
28

예제 출력1
34 1C

예제 입력2
99

예제 출력2
143 63
'''
# -*- coding: utf-8 -*-
import sys
input = sys.stdin.readline

if __name__=="__main__":

    N = int(input())

    # octa = oct(N)[2:].upper()
    # hexa = hex(N)[2:].upper()

    octa = format(N, 'o').upper()
    hexa = format(N, 'x').upper()

    print(octa, hexa)