'''
어떤 정수를 다른 어떤 정수로 나누면 나머지 수가 발생합니다.
또, 어떤 수로 나누느냐에 따라 다른 나머지가 발생할 수 있습니다. 

예를 들어 23을 5로 나누면 나머지가 3이지만, 7로 나누면 나머지는 2입니다.
100 이상의 정수 N이 주어지면 N을 각각 5와 7로 나누었을 때의 나머지 중 더 큰 나머지를 출력하는 프로그램을 작성하세요.
------------------------------------------------------------------------
[입력값 설명]
『첫째 줄에 정수 N이 주어집니다. (100 ≤ N ≤ 10,000)』

[출력값 설명]
『N을 5와 7로 나누었을 때의 나머지 중에서 더 큰 값을 출력합니다.
만약 같더라도 하나만 출력합니다.』
------------------------------------------------------------------------
예제 입력1
37

예제 출력1
2

예제 입력2
9995

예제 출력2
6
'''
# -*- coding: utf-8 -*-
import sys
input = sys.stdin.readline

N = int(input())

print(N%5 if N%5 > N%7 else N%7)