'''
또리는 챗봇을 만들었습니다. 
챗봇은 메신저에서 유저와 소통하는 봇을 말합니다. 

그런데 또리가 챗봇을 만드는 도중 중간에 실수가 있었는지 작동이 이상합니다.

챗봇은 You라고 입력하면 Me, 그 외의 모든 경우의 입력에는 No 라고 답합니다. 

챗봇에 입력한 문자열 A가 입력되었을 때 챗봇이 답한 문자열을 출력하는 프로그램을 작성하세요. 
------------------------------------------------------------------------
[입력값 설명]
『문자열 A가 한 줄에 걸쳐 입력됩니다. (1 ≤ 문자열의 길이 ≤ 1,000)』

[출력값 설명]
『문자열 A가 'You'이면 'Me'라고 출력하고,
그렇지 않으면 'No'라고 출력합니다.』
------------------------------------------------------------------------
예제 입력1
Are you?

예제 출력1
No

예제 입력2
You

예제 출력2
Me
'''
# -*- coding: utf-8 -*-
import sys
input = sys.stdin.readline

Q = input().rstrip()

if Q == 'You': print('Me')
else: print('No')