'''
영태는 학교에서 원의 반지름과 원의 넓이의 관계에 대해 배웠습니다. 

잘 알려진 바와 같이, 원의 넓이는 반지름 × 반지름 × 원주율과 같습니다. 

영태는 아직 초등학생이기 때문에 원주율(PI)의 값은 소수점 두 자리까지, 즉 3.14로 합니다.

원의 반지름이 주어지면 원의 넓이를 출력하는 프로그램을 작성하세요. 
------------------------------------------------------------------------
[입력값 설명]
『첫째 줄에 원의 반지름 R이 입력됩니다. (1 ≤ R ≤ 1,000, R은 정수)』

[출력값 설명]
『첫째 줄에 원의 넓이를 출력합니다.

소수 부분은 0으로 끝나지 않아야 하며,
답이 정수인 경우 소수 부분을 아예 출력하지 않습니다.』
------------------------------------------------------------------------
예제 입력1
10

예제 출력1
314

예제 입력2
5

예제 출력2
78.5
'''
# -*- coding: utf-8 -*-
import sys
input = sys.stdin.readline

r=int(input())
a = r**2 * 3.14 
b = int(a)
if a - b == 0.0:
    print(b)
else:
    print(a)