'''
세아는 영어를 너무 좋아한 나머지 자기만의 영어사전을 만들려고 합니다. 

머릿속에 떠오른 영어단어를 다음과 같은 기준에 따라 정리하려고 합니다.

우선, 길이가 짧은 단어부터 순서대로 나열합니다. 
만약 단어의 길이가 같다면 사전순대로 정리합니다. 
세아가 사전을 만드는 프로그램을 작성하세요.
-------------------------------------------
[입력값 설명]
첫째 줄에 영단어의 개수 N이 주어집니다. (1 ≤ N ≤ 1,000)
둘째 줄부터 N개의 줄에 걸쳐 알파벳 소문자로 이루어진 단어가 한 줄에 하나씩 주어집니다.
주어지는 문자열의 길이는 50을 넘지 않습니다

[출력값 설명]
기준에 따라 정렬하여 단어들을 출력합니다.
단, 같은 단어가 여러 번 입력된 경우에는 한 번씩만 출력합니다.
--------------------------------------------------

예제 입력1
3

예제 출력1
3

예제 입력2
5

예제 출력2
8

'''
# 정렬 문제 
import sys
sys.stdin=open('input.txt', 'r')
input=sys.stdin.readline

if __name__=="__main__":
    N=int(input())
    dic = []
    for _ in range(N):
        txt = input().rstrip()
        if [txt,len(txt)] not in dic:
            dic.append([txt,len(txt)])
    
    dic.sort(key=lambda x: (x[1],x[0]))
    
    for i in range(len(dic)):
        print(dic[i][0])