'''
그래프 중에서 모든 간선이 특별한 방향성을 가지지 않는 그래프를 무향 그래프라고 합니다. 

무향 그래프가 주어졌을 때, 
각 정점이 연결되어 있는 상황을 출력하는 프로그램을 작성하세요. 

이때, 초기에는 자기 자신과는 연결되어 있지 않고 자기 자신과 연결된 간선이 들어왔을 때만 연결된 것으로 가정합니다.
-------------------------------------------
[입력값 설명]
첫 번째 줄에는 정점의 개수 N과 간선의 개수 M이 주어집니다. (1 ≤ N, M ≤ 1,000)
둘째 줄부터는 M개의 줄에 걸쳐 연결 할 두 노드가 공백을 구분으로 주어집니다.

[출력값 설명]
그래프에서 각 간선이 연결된 형태를 N * N의 인접 행렬 형태로 출력합니다.
--------------------------------------------------

예제 입력1
3 3
1 2
1 3
2 3

예제 출력1
0 1 1
1 0 1
1 1 0

예제 입력2
6 8
1 2
1 4
1 5
2 3
2 6
3 4
4 5
5 6

예제 출력2
0 1 0 1 1 0
1 0 1 0 0 1
0 1 0 1 0 0
1 0 1 0 1 0
1 0 0 1 0 1
0 1 0 0 1 0

'''
# 그래프 문제 

import sys
sys.stdin=open('input.txt', 'r')
input=sys.stdin.readline

if __name__=="__main__":
    N,M=map(int, input().split())
    graph = [[] for _ in range(N)]
    for _ in range(M):
        a,b = map(int,input().split())
        graph[a-1].append(b-1)
        graph[b-1].append(a-1)
    
    res = [[0]*(N) for _ in range(N)] 
    for i, row in enumerate(graph):
        for col in row:
            res[i][col] = 1
    
    for r in res:
        print(*r)