'''
N개의 한 자리 정수들이 주어졌을 때 
이 정수들을 서로 이어붙여 만들 수 있는 가장 큰 300의 배수를 구하는 프로그램을 작성하세요. 


이 때, 주어진 모든 정수를 사용해야 합니다. 
예를 들어 3, 6, 9, 0, 5, 0, 7, 6이 주어졌을 때 만들 수 있는 가장 큰 300의 배수는 97665300입니다.

0 또한 300의 배수임에 유의합니다.
-------------------------------------------
[입력값 설명]
첫째 줄에 정수의 개수 N이 주어집니다. (1 ≤ N ≤ 100)
둘째 줄에는 N개의 정수가 공백으로 구분되어 주어집니다.
각 정수 K에 대하여 0 ≤ K ≤ 9가 성립합니다.

[출력값 설명]
주어진 정수를 모두 이어붙여 만들 수 있는 가장 큰 300의 배수를 출력합니다.
이 때 만들어지는 수가 0이 아닌데 0으로 시작해서는 안 됩니다.
답이 0이라면 하나의 0만을 출력해야 합니다.
즉, 300을 출력할 때, 0300과 같은 형식으로 출력해서는 안 됩니다.
만약 300의 배수를 만들 수 없다면 -1을 출력합니다.
--------------------------------------------------

예제 입력1
4
2 4 0 0

예제 출력1
4200

예제 입력2
4
3 6 0 3

예제 출력2
-1
'''
# 


import sys
sys.stdin=open('input.txt', 'r')
input=sys.stdin.readline

from itertools import permutations


if __name__=="__main__":
    N=int(input())
    nums = list(map(str, input().split()))
    nums.sort(reverse=True)
    for x in permutations(nums,N):
        a = int(''.join(x))
        if a % 300 == 0:
            print(a)
            exit()
    
    print(-1)


